test_playbook/expects/book_4_import_role.mmd
stateDiagram-v2
    state "Play: Test 4 import_role" as play_1 {
        state "Begin<hr>action: debug" as task_1
        state "role_1 : Role Start<hr>action: debug" as task_2
        state "role_1 : Role End<hr>action: debug" as task_3
        state "End<hr>action: debug" as task_4
    }
    [*] --> task_1
    task_1 --> task_2
    task_2 --> task_3
    task_3 --> task_4
    task_4 --> [*]
